Revit 2027 API
SizingOptions.SetEquivalentWidth Method
 Sets the equivalent width based on the specified height.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEquivalentWidth(
	double fixedHeight,
	ISet<MEPSize> availableSizes
)
Public Sub SetEquivalentWidth (
	fixedHeight As Double,
	availableSizes As ISet(Of MEPSize)
)
public:
void SetEquivalentWidth(
	double fixedHeight,
	ISet<MEPSize^>^ availableSizes
)
member SetEquivalentWidth :
        fixedHeight : float *
        availableSizes : ISet<MEPSize> -> unit
Parameters
fixedHeight Double
 The new height.
availableSizes ISet<MEPSize>
 The sorted list of available sizes, where the equivalent width will be selected.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for fixedHeight must be positive. -or- The fixedHeight must be within the range of availableSizes. -or- The new size must be within the range of available sizes.
Remarks
 The equivalent width is calculated based on the specified height and the available sizes. If successful, the new width and height in the options provide the same or similar friction loss as the previous width and height.
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace